

# #a,b 를 입력받아 
# #합계가 100 넘으면 100보다큰수, 100보다작은수 라고 출력하시오.

# #1. 숫자입력
# a = int(input("숫자를 입력하시오 : "))
# b = int(input("숫자를 입력하시오 : "))

# #2. 합계
# total=a+b

# #3. 조건
# if total>100 :
#     print("합계 100보다 큰수입니다.")
# else:
#     print("합계 100보다 작은수입니다.")

# print("입력값 a : {} ,입력값 b : {} ,합계 : {}".format(a,b,total))



# # print("10"==10) #문자10과 숫자 10은 다름
# a = int(input("숫자입력 : ")) #문자타입 -> 숫자타입

# if a>100:
#     print("100보다 큰수")
# else:
#     print("100보다 작은수")

# print("입력한 숫자 : ",a)


# a = 101
# if a<100 :
#     print("100보다 작은수입니다.")
# else :
#     print("100보다 큰수입니다.")

# print("종료")