# ============================================================
# Python 30일차
# Pandas 기초 / Series / DataFrame / 조건검색
# ============================================================

import pandas as pd


# ============================================================
# Q1.
#
# 다음 리스트를 Pandas Series로 만드세요.
#
# 변수 이름:
# scores
#
# 데이터:
# 90, 80, 100, 70
#
# 만든 뒤 출력하세요.
# ============================================================
# scores = pd.Series([90, 80, 100, 70])
# print(scores)



# ============================================================
# Q2.
#
# Q1의 scores에서 다음을 출력하세요.
#
# ① 합계 
# ② 평균
# ③ 최댓값
# ④ 최솟값

# print(scores.sum())
# print(scores.mean())
# print(scores.max())
# print(scores.min())

#
# 힌트:
# sum()
# mean()
# max()
# min()
# ============================================================





# ============================================================
# Q3.
#
# 다음 dictionary를 이용해서
# DataFrame을 만드세요.
#
# 변수 이름은 df로 하세요.
#
# 만든 뒤 df 전체를 출력하세요.
# ============================================================

data = {
    "name": ["영희", "철수", "민수"],
    "age": [30, 25, 35],
    "visit": [10, 5, 12]
}
df = pd.DataFrame(data)
print(df)




# ============================================================
# Q4.
#
# df에서
# name 열만 출력하세요.
#
# 힌트:
# df["????"]
# ============================================================

# print(df[["name"]])




# ============================================================
# Q5.
#
# df에서
#
# name
# visit
#
# 두 개의 열만 출력하세요.
#
# 힌트:
# 열 여러 개를 가져올 때는
# 리스트를 사용합니다.
#
# df[[????, ????]]
# ============================================================
# print(df[["name","visit"]])




# ============================================================
# Q6.
#
# 방문횟수 visit가
# 8 이상인 회원의
# 행 전체를 출력하세요.
#
# 예상되는 회원:
#
# 영희
# 민수
# ============================================================
# print(df[df["visit"]>=8])




# ============================================================
# Q7.
#
# 나이가 30 이상이고
# 방문횟수가 8 이상인 회원의
# 행 전체를 출력하세요.
#
# & 를 사용하세요.
#
# 예상되는 회원:
#
# 영희
# 민수
# ============================================================
# print(df[(df["age"] >= 30)&(df["visit"] >= 8)])




# ============================================================
# Q8. 실무 데이터 분석 ⭐
#
# 다음 상품 데이터를
# DataFrame으로 만드세요.
#
# 그리고 판매량 sales가
# 10개 이상인 상품의
# 행 전체를 출력하세요.
#
# 예상되는 상품:
#
# 니트
# 스카프
# ============================================================

# products = {
#     "product": ["니트", "가디건", "스카프", "자켓"],
#     "price": [120000, 250000, 80000, 350000],
#     "sales": [10, 5, 20, 3]
# }
# df = pd.DataFrame(products)
# print(df[df["sales"]>=10])




# ============================================================
# Q9. 도전문제 ⭐
#
# Q8에서 만든 DataFrame에서
#
# 가격이 100000원 이상이고
# 판매량이 5개 이상인 상품만
# 출력하세요.
#
# 예상되는 상품:
#
# 니트
# 가디건
#
# & 를 사용하세요.
# ============================================================
# print(df[(df["price"]>=100000)&(df["sales"]>=5)])